tests/fixtures/invoice_with_no_vendor_address.json

{
  "number": "123456",
  "vendor": {
    "value": "vendor_no_address",
    "desc": "Vendor with no address"
  },
  "owner": {
    "value": "ACQ",
    "desc": null
  },
  "id": "00000055555000000",
  "invoice_date": "2021-09-27Z",
  "total_amount": 4056.07,
  "currency": {
    "value": "USD",
    "desc": "US Dollar"
  },
  "total_invoice_lines_amount": 4056.07,
  "vendor_contact_person": {},
  "payment_method": {
    "value": "ACCOUNTINGDEPARTMENT",
    "desc": "Accounting Department"
  },
  "reference_number": "",
  "creation_form": {
    "value": "EDI",
    "desc": "EDIteur Invoice Message"
  },
  "invoice_status": {
    "value": "ACTIVE",
    "desc": "Active"
  },
  "invoice_workflow_status": {
    "value": "Waiting to be Sent",
    "desc": "Ready to be paid"
  },
  "invoice_approval_status": {
    "value": "APPROVED",
    "desc": "Approved"
  },
  "approved_by": "Smith Jane Q",
  "approval_date": "2021-10-19Z",
  "additional_charges": {
    "use_pro_rata": true,
    "shipment": 0.0,
    "overhead": 0.0,
    "insurance": 0.0,
    "discount": 0.0
  },
  "invoice_vat": {
    "report_tax": false,
    "vat_per_invoice_line": false,
    "vat_code": {
      "value": "",
      "desc": null
    },
    "percentage": 0.0,
    "vat_amount": 0,
    "type": {
      "value": "LINEEXCLUSIVE",
      "desc": "Line Exclusive"
    },
    "expended_from_fund": true
  },
  "explicit_ratio": [],
  "payment": {
    "prepaid": false,
    "internal_copy": false,
    "payment_status": {
      "value": "NOT_PAID",
      "desc": "Not Paid"
    },
    "voucher_date": "2021-09-30Z",
    "voucher_number": "",
    "voucher_amount": "",
    "voucher_currency": {
      "value": "",
      "desc": null
    }
  },
  "alert": [
    {
      "value": "ADDITIONAL_INVOICE_EXISTS",
      "desc": "Additional Invoice lines are linked to the same PO line"
    },
    {
      "value": "DIFFERENT_VENDOR_ACCOUNT",
      "desc": "Invoice holds vendor account different than some of the linked PO lines"
    },
    {
      "value": "DIFF_PRICE_THAN_POLINE",
      "desc": "Some invoice lines differ in price from their linked PO line."
    },
    {
      "value": "EDI_INVOICE_OF_EXTERNAL_SYSTEM",
      "desc": "The invoice was created by an external system and need to be reviewed."
    },
    {
      "value": "NOT_LINKED_LINES",
      "desc": "Lines not linked"
    }
  ],
  "note": [],
  "number_of_lines": {
    "value": 1,
    "link": "http://example.com/acq/invoices/00000055555000000/lines"
  },
  "invoice_lines": {
    "invoice_line": [
      {
        "id": "00000050010000000",
        "type": {
          "value": "OTHER",
          "desc": "Other"
        },
        "number": "1",
        "status": {
          "value": "READY",
          "desc": "Ready"
        },
        "po_line": "",
        "price": 69.75,
        "price_note": "",
        "total_price": 69.75,
        "quantity": 1,
        "vat_note": "Approximately 0.00 included in line Total Price.",
        "check_subscription_date_overlap": true,
        "fully_invoiced": false,
        "additional_info": "",
        "release_remaining_encumbrance": false,
        "reporting_code": {
          "value": "",
          "desc": null
        },
        "secondary_reporting_code": {
          "value": "",
          "desc": null
        },
        "tertiary_reporting_code": {
          "value": "",
          "desc": null
        },
        "note": "",
        "invoice_line_vat": {
          "vat_code": {
            "value": "",
            "desc": null
          },
          "percentage": 0.0,
          "vat_amount": 0
        },
        "fund_distribution": [
          {
            "fund_code": {
              "value": "ABC",
              "desc": "Fund ABC"
            },
            "percent": 100.0,
            "amount": 69.75
          }
        ],
        "link": "http://example.com/acq/invoices/00000055555000000/lines/00000050010000000"
      }
    ],
    "total_record_count": 1
  },
  "link": "http://example.com/acq/invoices/00000055555000000"
}